open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_bt_test.c
/****************************************************************************
 * chips/bk7258/common/
 * bk7258_bt_test.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Generation-safe control plane for N12 Bluetooth hardware validation.
 * RPMsg callbacks only copy requests/results and signal semaphores.  The AP
 * performs socket ioctls and bounded scan waits in one logical-CPU0 worker.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_BT_IPC_TEST

#include <errno.h>
#include <pthread.h>
#include <sched.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#ifdef CONFIG_BK7258_AP_CORE
#  include <sys/ioctl.h>
#  include <sys/socket.h>
#  include <unistd.h>

#  include <netpacket/bluetooth.h>

#  include <nuttx/net/bluetooth.h>
#  include <nuttx/wireless/bluetooth/bt_ioctl.h>
#endif

#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/rpmsg/rpmsg.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>

#include <arch/chip/bk7258_bt_ipc.h>
#ifdef CONFIG_BK7258_AP_CORE
#  include <arch/chip/bk7258_radio_mode.h>
#endif
#include <arch/chip/bk7258_rptun.h>

#include "bk7258_rptun.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_BT_TEST_EPT_NAME          "bk7258-bt-test"
#define BK7258_BT_TEST_WIRE_MAGIC        0x57544242u /* "BBTW" */
#define BK7258_BT_TEST_WIRE_VERSION      1u
#define BK7258_BT_TEST_SEND_TIMEOUT_MS   500u
#define BK7258_BT_TEST_CONNECT_MS        3000u

#ifdef CONFIG_BK7258_AP_CORE
#  define BK7258_BT_TEST_REMOTE_NAME     "cp"
#  define BK7258_BT_TEST_IFNAME          "bnep0"
#  define BK7258_BT_TEST_MAX_RESULTS     8u
#  define BK7258_BT_TEST_AD_MANUFACTURER 0xffu
#  define BK7258_BT_TEST_N12V_AD_LENGTH  11u
#else
#  define BK7258_BT_TEST_REMOTE_NAME     "ap"
#endif

enum bk7258_bt_test_command_e
{
  BK7258_BT_TEST_COMMAND_START = 1,
  BK7258_BT_TEST_COMMAND_REPORT
};

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_bt_test_wire_s
{
  uint32_t magic;
  uint32_t version;
  uint32_t command;
  uint32_t generation;
  uint32_t sequence;
  uint32_t operation;
  uint32_t scan_duration_ms;
  uint32_t timeout_ms;
  struct bk7258_bt_test_result_s result;
};

struct bk7258_bt_test_dev_s
{
  struct rpmsg_endpoint ept;
  bool initialized;
  bool endpoint_created;
  int connection_error;
#ifdef CONFIG_BK7258_AP_CORE
  sem_t request_sem;
  bool abort;
  bool busy;
  int request_status;
  uint32_t request_generation;
  uint32_t request_sequence;
  uint32_t request_operation;
  uint32_t request_scan_duration_ms;
  uint32_t request_timeout_ms;
#else
  sem_t report_sem;
  bool report_valid;
  uint32_t waiting_generation;
  uint32_t waiting_sequence;
  struct bk7258_bt_test_result_s report;
#endif
};

/****************************************************************************
 * Compile-time ABI Gates
 ****************************************************************************/

static_assert(offsetof(struct bk7258_bt_test_wire_s, result) == 32u,
              "BK7258 Bluetooth test wire header changed");
static_assert(sizeof(struct bk7258_bt_test_wire_s) <=
              BK7258_RPMSG_TEST_FRAME_SIZE,
              "BK7258 Bluetooth report cannot fit one RPMsg frame");
static_assert(sizeof(struct bk7258_bt_test_wire_s) ==
              BK7258_RPMSG_TEST_FRAME_SIZE,
              "BK7258 Bluetooth report must account for the full frame");

#if defined(CONFIG_BK7258_AP_CORE) && \
    defined(CONFIG_BK7258_AP_SUPERVISOR)
static_assert(CONFIG_BK7258_BT_IPC_TEST_PRIORITY <
              CONFIG_BK7258_AP_SUPERVISOR_PRIORITY,
              "Bluetooth test worker must remain below AP heartbeat");
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct bk7258_bt_test_dev_s g_bk7258_bt_test;

#ifndef CONFIG_BK7258_AP_CORE
static mutex_t g_bk7258_bt_test_lock = NXMUTEX_INITIALIZER;
static uint32_t g_bk7258_bt_test_next_sequence;
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static int bk7258_bt_test_sem_init(sem_t *sem)
{
  int ret = nxsem_init(sem, 0, 0);

#ifdef CONFIG_PRIORITY_INHERITANCE
  if (ret >= 0)
    {
      ret = nxsem_set_protocol(sem, SEM_PRIO_NONE);
    }
#endif

  return ret;
}

#ifndef CONFIG_BK7258_AP_CORE
static void bk7258_bt_test_flush_sem(sem_t *sem)
{
  while (nxsem_trywait(sem) == OK)
    {
    }
}
#endif

static bool bk7258_bt_test_generation_ready(uint32_t generation)
{
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();

  __asm volatile ("dmb sy" ::: "memory");
  return generation != 0 &&
         control->magic == BK7258_RPTUN_CONTROL_MAGIC &&
         control->version == BK7258_RPTUN_CONTROL_VERSION &&
         control->size == sizeof(*control) &&
         control->generation == generation &&
         control->state == BK7258_RPTUN_STATE_CONNECTED;
}

static bool bk7258_bt_test_endpoint_ready(void)
{
  struct bk7258_bt_test_dev_s *priv = &g_bk7258_bt_test;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();

  return __atomic_load_n(&priv->endpoint_created, __ATOMIC_ACQUIRE) &&
         bk7258_bt_test_generation_ready(control->generation) &&
         is_rpmsg_ept_ready(&priv->ept);
}

static bool bk7258_bt_test_deadline_expired(clock_t started,
                                             uint32_t timeout_ms)
{
  return clock_systime_ticks() - started >= MSEC2TICK(timeout_ms);
}

static int bk7258_bt_test_send_bounded(const void *data, size_t length,
                                       uint32_t generation,
                                       uint32_t timeout_ms)
{
  struct bk7258_bt_test_dev_s *priv = &g_bk7258_bt_test;
  clock_t started = clock_systime_ticks();
  int ret = -ENOTCONN;

