open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_bt_test.c
  for (; ; )
    {
      if (!bk7258_bt_test_endpoint_ready() ||
          !bk7258_bt_test_generation_ready(generation))
        {
          return -ENOTCONN;
        }

      ret = rpmsg_trysend(&priv->ept, data, length);
      if (ret >= 0)
        {
          return OK;
        }

      if (ret != -ENOMEM && ret != -EAGAIN)
        {
          return ret;
        }

      if (bk7258_bt_test_deadline_expired(started, timeout_ms))
        {
          return -ETIMEDOUT;
        }

      nxsig_usleep(1000);
    }
}

#ifdef CONFIG_BK7258_AP_CORE

static int bk7258_bt_test_neg_errno(void)
{
  int error = get_errno();

  return error > 0 ? -error : -EIO;
}

static void bk7258_bt_test_prepare_request(struct btreq_s *request)
{
  memset(request, 0, sizeof(*request));
  strlcpy(request->btr_name, BK7258_BT_TEST_IFNAME,
          sizeof(request->btr_name));
}

static bool bk7258_bt_test_address_valid(const uint8_t *address)
{
  bool all_zero = true;
  bool all_ff = true;
  unsigned int i;

  for (i = 0; i < 6; i++)
    {
      all_zero = all_zero && address[i] == 0;
      all_ff = all_ff && address[i] == UINT8_MAX;
    }

  /* bt_addr_t stores HCI byte order, so the public/OUI octet is val[5]. */

  return !all_zero && !all_ff && (address[5] & 1u) == 0;
}

static bool bk7258_bt_test_address_fallback(const uint8_t *address)
{
  static const uint8_t hci_order[6] =
    {
      0x19, 0x00, 0x00, 0x8c, 0x47, 0xc8
    };

  static const uint8_t sdk_order[6] =
    {
      0xc8, 0x47, 0x8c, 0x00, 0x00, 0x19
    };

  return memcmp(address, hci_order, sizeof(hci_order)) == 0 ||
         memcmp(address, sdk_order, sizeof(sdk_order)) == 0;
}

static int bk7258_bt_test_info(int socket_fd,
                               struct bk7258_bt_test_result_s *result)
{
  struct btreq_s request;
  int ret;

  bk7258_bt_test_prepare_request(&request);
  ret = ioctl(socket_fd, SIOCGBTINFO,
              (unsigned long)((uintptr_t)&request));
  if (ret < 0)
    {
      return bk7258_bt_test_neg_errno();
    }

  memcpy(result->bdaddr, request.btr_bdaddr.val, sizeof(result->bdaddr));
  result->address_valid = bk7258_bt_test_address_valid(result->bdaddr);
  result->address_fallback =
    bk7258_bt_test_address_fallback(result->bdaddr);
  result->acl_mtu = request.btr_acl_mtu;
  result->acl_buffers = request.btr_num_acl;

  bk7258_bt_test_prepare_request(&request);
  ret = ioctl(socket_fd, SIOCGBTFEAT,
              (unsigned long)((uintptr_t)&request));
  if (ret < 0)
    {
      return bk7258_bt_test_neg_errno();
    }

  memcpy(result->features, request.btr_features0,
         sizeof(result->features));

  bk7258_bt_test_prepare_request(&request);
  ret = ioctl(socket_fd, SIOCGBTLEFEAT,
              (unsigned long)((uintptr_t)&request));
  if (ret < 0)
    {
      return bk7258_bt_test_neg_errno();
    }

  memcpy(result->le_features, request.btr_features0,
         sizeof(result->le_features));
  return result->address_valid ? OK : -EADDRNOTAVAIL;
}

static bool bk7258_bt_test_n12v_match(
  const struct bt_scanresponse_s *response)
{
  static const uint8_t expected[] =
  {
    0xfe, 0xff, 0x4e, 0x31, 0x32, 0x56, 0x01, 0x02, 0x03, 0x04
  };

  uint8_t offset = 0;

  while (offset < response->sr_len)
    {
      uint8_t field_length = response->sr_data[offset];
      uint8_t remaining = response->sr_len - offset;

      if (field_length == 0)
        {
          break;
        }

      if (field_length >= remaining)
        {
          return false;
        }

      if (field_length >= BK7258_BT_TEST_N12V_AD_LENGTH &&
          response->sr_data[offset + 1] ==
            BK7258_BT_TEST_AD_MANUFACTURER &&
          memcmp(&response->sr_data[offset + 2], expected,
                 sizeof(expected)) == 0)
        {
          return true;
        }

      offset += field_length + 1;
    }

  return false;
}

static int bk7258_bt_test_scan(int socket_fd, uint32_t duration_ms,
                               struct bk7258_bt_test_result_s *result)
{
  struct bt_scanresponse_s responses[BK7258_BT_TEST_MAX_RESULTS];
  struct btreq_s request;
  bool scanning = false;
  uint8_t copy_length;
  uint8_t selected = 0;
  uint8_t i;
  int stop_ret = OK;
  int release_ret;
  int ret;

  ret = bk7258_radio_mode_acquire(BK7258_RADIO_MODE_BLE_SCAN);
  if (ret < 0)
    {
      return ret;
    }

  bk7258_bt_test_prepare_request(&request);
  request.btr_dupenable = true;
  ret = ioctl(socket_fd, SIOCBTSCANSTART,
              (unsigned long)((uintptr_t)&request));
  if (ret < 0)
    {
      ret = bk7258_bt_test_neg_errno();
      goto out_release;
    }

  scanning = true;
  (void)nxsig_usleep(duration_ms * 1000u);

  memset(responses, 0, sizeof(responses));
  bk7258_bt_test_prepare_request(&request);
  request.btr_nrsp = BK7258_BT_TEST_MAX_RESULTS;
  request.btr_rsp = responses;
  ret = ioctl(socket_fd, SIOCBTSCANGET,
              (unsigned long)((uintptr_t)&request));
  if (ret < 0)
    {
      ret = bk7258_bt_test_neg_errno();
    }
  else
    {
      result->scan_results = request.btr_nrsp;
      if (request.btr_nrsp > 0)
        {
          for (i = 0; i < request.btr_nrsp; i++)
            {
              if (bk7258_bt_test_n12v_match(&responses[i]))
                {
                  selected = i;
                  result->n12v_payload_match = 1;
                  break;
                }
            }

          result->selected_index = selected;
          memcpy(result->first_addr, responses[selected].sr_addr.val,
                 sizeof(result->first_addr));
          result->first_addr_type = responses[selected].sr_addr.type;
          result->first_rssi = responses[selected].sr_rssi;
          result->first_adv_type = responses[selected].sr_type;
          copy_length = responses[selected].sr_len;
          if (copy_length > sizeof(result->first_adv_data))
            {
              copy_length = sizeof(result->first_adv_data);
            }

          result->first_adv_len = copy_length;
          memcpy(result->first_adv_data, responses[selected].sr_data,
                 copy_length);
        }
      else
        {
          ret = -ENODATA;
        }
    }

  if (scanning)
    {
      bk7258_bt_test_prepare_request(&request);
      if (ioctl(socket_fd, SIOCBTSCANSTOP,
                (unsigned long)((uintptr_t)&request)) < 0)
        {
          stop_ret = bk7258_bt_test_neg_errno();
        }
    }

out_release:
  release_ret = bk7258_radio_mode_release(BK7258_RADIO_MODE_BLE_SCAN);
  if (ret >= 0 && stop_ret >= 0 && release_ret < 0)
    {
      return release_ret;
    }

  return ret < 0 ? ret : stop_ret;
}

static int bk7258_bt_test_execute(uint32_t operation,
                                  uint32_t scan_duration_ms,
                                  struct bk7258_bt_test_result_s *result)
{
  int socket_fd;
  int ret;

  if (operation == BK7258_BT_TEST_OPERATION_STATS)
    {
      ret = bk7258_bt_hci_get_stats(&result->hci);
      return ret;
    }

  socket_fd = socket(PF_BLUETOOTH, SOCK_RAW, BTPROTO_L2CAP);
  if (socket_fd < 0)
    {
      return bk7258_bt_test_neg_errno();
    }

  ret = bk7258_bt_test_info(socket_fd, result);
  if (ret >= 0 && operation == BK7258_BT_TEST_OPERATION_SCAN)
    {
      ret = bk7258_bt_test_scan(socket_fd, scan_duration_ms, result);
    }

  close(socket_fd);
  return ret;
}

