open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_bt_test.c
static void bk7258_bt_test_result_init(
  struct bk7258_bt_test_result_s *result, uint32_t generation,
  uint32_t sequence, uint32_t operation, uint32_t scan_duration_ms)
{
  int cpu = sched_getcpu();

  memset(result, 0, sizeof(*result));
  result->magic = BK7258_BT_TEST_RESULT_MAGIC;
  result->version = BK7258_BT_TEST_RESULT_VERSION;
  result->size = sizeof(*result);
  result->generation = generation;
  result->sequence = sequence;
  result->operation = operation;
  result->worker_cpu = cpu >= 0 ? (uint32_t)cpu : UINT32_MAX;
  result->scan_duration_ms = scan_duration_ms;
  result->gatt.worker_cpu = UINT8_MAX;
}

static FAR void *bk7258_bt_test_worker(FAR void *arg)
{
  struct bk7258_bt_test_dev_s *priv = &g_bk7258_bt_test;
  struct bk7258_bt_test_wire_s report;
  uint32_t generation;
  uint32_t sequence;
  uint32_t operation;
  uint32_t duration_ms;
  uint32_t timeout_ms;
  int status;

  (void)arg;
  for (; ; )
    {
      if (nxsem_wait_uninterruptible(&priv->request_sem) < 0)
        {
          continue;
        }

      if (__atomic_load_n(&priv->abort, __ATOMIC_ACQUIRE))
        {
          __atomic_store_n(&priv->busy, false, __ATOMIC_RELEASE);
          continue;
        }

      __asm volatile ("dmb sy" ::: "memory");
      generation = priv->request_generation;
      sequence = priv->request_sequence;
      operation = priv->request_operation;
      duration_ms = priv->request_scan_duration_ms;
      timeout_ms = priv->request_timeout_ms;
      status = priv->request_status;

      memset(&report, 0, sizeof(report));
      report.magic = BK7258_BT_TEST_WIRE_MAGIC;
      report.version = BK7258_BT_TEST_WIRE_VERSION;
      report.command = BK7258_BT_TEST_COMMAND_REPORT;
      report.generation = generation;
      report.sequence = sequence;
      report.operation = operation;
      report.scan_duration_ms = duration_ms;
      report.timeout_ms = timeout_ms;
      bk7258_bt_test_result_init(&report.result, generation, sequence,
                                 operation, duration_ms);

      if (status >= 0 && !bk7258_bt_test_generation_ready(generation))
        {
          status = -ESTALE;
        }

      if (status >= 0)
        {
          status = bk7258_bt_test_execute(operation, duration_ms,
                                          &report.result);
        }

      report.result.status = status;
      (void)bk7258_bt_test_send_bounded(
        &report, sizeof(report), generation,
        timeout_ms < BK7258_BT_TEST_SEND_TIMEOUT_MS ?
        timeout_ms : BK7258_BT_TEST_SEND_TIMEOUT_MS);
      __atomic_store_n(&priv->busy, false, __ATOMIC_RELEASE);
    }

  return NULL;
}

static int bk7258_bt_test_spawn_worker(void)
{
  pthread_attr_t attr;
  struct sched_param param;
  cpu_set_t cpuset = (cpu_set_t)1u;
  pthread_t thread;
  bool initialized = false;
  int ret;

  ret = pthread_attr_init(&attr);
  if (ret == 0)
    {
      initialized = true;
      ret = pthread_attr_setdetachstate(&attr, PTHREAD_CREATE_DETACHED);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setstacksize(&attr,
                                      CONFIG_BK7258_BT_IPC_TEST_STACKSIZE);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setaffinity_np(&attr, sizeof(cpuset), &cpuset);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setinheritsched(&attr, PTHREAD_EXPLICIT_SCHED);
    }

  if (ret == 0)
    {
      ret = pthread_attr_setschedpolicy(&attr, SCHED_FIFO);
    }

  if (ret == 0)
    {
      memset(&param, 0, sizeof(param));
      param.sched_priority = CONFIG_BK7258_BT_IPC_TEST_PRIORITY;
      ret = pthread_attr_setschedparam(&attr, &param);
    }

  if (ret == 0)
    {
      ret = pthread_create(&thread, &attr, bk7258_bt_test_worker, NULL);
      if (ret == 0)
        {
          (void)pthread_setname_np(thread, "bk-bt-test");
        }
    }

  if (initialized)
    {
      (void)pthread_attr_destroy(&attr);
    }

  return ret == 0 ? OK : -ret;
}

static void bk7258_bt_test_send_immediate_error(
  const struct bk7258_bt_test_wire_s *request, int status)
{
  struct bk7258_bt_test_wire_s report;

  memset(&report, 0, sizeof(report));
  report.magic = BK7258_BT_TEST_WIRE_MAGIC;
  report.version = BK7258_BT_TEST_WIRE_VERSION;
  report.command = BK7258_BT_TEST_COMMAND_REPORT;
  report.generation = request->generation;
  report.sequence = request->sequence;
  report.operation = request->operation;
  report.scan_duration_ms = request->scan_duration_ms;
  report.timeout_ms = request->timeout_ms;
  bk7258_bt_test_result_init(&report.result, request->generation,
                             request->sequence, request->operation,
                             request->scan_duration_ms);
  report.result.status = status;
  (void)rpmsg_trysend(&g_bk7258_bt_test.ept, &report, sizeof(report));
}

#endif /* CONFIG_BK7258_AP_CORE */

static int bk7258_bt_test_ept_cb(FAR struct rpmsg_endpoint *ept,
                                  FAR void *data, size_t length,
                                  uint32_t source, FAR void *priv_)
{
  struct bk7258_bt_test_dev_s *priv = priv_;
  struct bk7258_bt_test_wire_s *message = data;

  (void)ept;
  (void)source;
  if (message == NULL ||
      length < offsetof(struct bk7258_bt_test_wire_s, result) ||
      message->magic != BK7258_BT_TEST_WIRE_MAGIC ||
      message->version != BK7258_BT_TEST_WIRE_VERSION)
    {
      return -EINVAL;
    }

#ifdef CONFIG_BK7258_AP_CORE
  if (message->command == BK7258_BT_TEST_COMMAND_START &&
      length == offsetof(struct bk7258_bt_test_wire_s, result))
    {
      bool expected = false;
      int request_status = OK;

      if (!__atomic_compare_exchange_n(&priv->busy, &expected, true, false,
                                       __ATOMIC_ACQ_REL, __ATOMIC_ACQUIRE))
        {
          bk7258_bt_test_send_immediate_error(message, -EBUSY);
          return OK;
        }

      if ((message->operation != BK7258_BT_TEST_OPERATION_INFO &&
           message->operation != BK7258_BT_TEST_OPERATION_SCAN &&
           message->operation != BK7258_BT_TEST_OPERATION_STATS) ||
          message->timeout_ms < BK7258_BT_TEST_TIMEOUT_MIN_MS ||
          message->timeout_ms > BK7258_BT_TEST_TIMEOUT_MAX_MS ||
          ((message->operation == BK7258_BT_TEST_OPERATION_INFO ||
            message->operation == BK7258_BT_TEST_OPERATION_STATS) &&
           message->scan_duration_ms != 0) ||
          (message->operation == BK7258_BT_TEST_OPERATION_SCAN &&
           (message->scan_duration_ms < BK7258_BT_TEST_SCAN_MIN_MS ||
            message->scan_duration_ms > BK7258_BT_TEST_SCAN_MAX_MS)))
        {
          request_status = -EINVAL;
        }
      else if (!bk7258_bt_test_generation_ready(message->generation))
        {
          request_status = -ESTALE;
        }

      priv->request_generation = message->generation;
      priv->request_sequence = message->sequence;
      priv->request_operation = message->operation;
      priv->request_scan_duration_ms = message->scan_duration_ms;
      priv->request_timeout_ms = message->timeout_ms;
      priv->request_status = request_status;
      __asm volatile ("dmb sy" ::: "memory");
      (void)nxsem_post(&priv->request_sem);
      return OK;
    }
#else
  if (message->command == BK7258_BT_TEST_COMMAND_REPORT &&
      length == sizeof(*message) &&
      message->generation == priv->waiting_generation &&
      message->sequence == priv->waiting_sequence)
    {
      memcpy(&priv->report, &message->result, sizeof(priv->report));
      __asm volatile ("dmb sy" ::: "memory");
      priv->report_valid = true;
      (void)nxsem_post(&priv->report_sem);
      return OK;
    }
#endif

