open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_bt_test.c
  return -ENOMSG;
}

static void bk7258_bt_test_device_created(FAR struct rpmsg_device *rdev,
                                           FAR void *priv_)
{
  struct bk7258_bt_test_dev_s *priv = priv_;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  if (cpuname == NULL || strcmp(cpuname, BK7258_BT_TEST_REMOTE_NAME) != 0)
    {
      return;
    }

#ifdef CONFIG_BK7258_AP_CORE
  priv->ept.priv = priv;
  priv->abort = false;
  priv->connection_error = rpmsg_create_ept(
    &priv->ept, rdev, BK7258_BT_TEST_EPT_NAME,
    RPMSG_ADDR_ANY, RPMSG_ADDR_ANY, bk7258_bt_test_ept_cb, NULL);
  if (priv->connection_error >= 0)
    {
      __atomic_store_n(&priv->endpoint_created, true, __ATOMIC_RELEASE);
    }
#else
  priv->connection_error = OK;
#endif
}

#ifndef CONFIG_BK7258_AP_CORE
static bool bk7258_bt_test_ns_match(FAR struct rpmsg_device *rdev,
                                    FAR void *priv_, FAR const char *name,
                                    uint32_t dest)
{
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  (void)priv_;
  (void)dest;
  return cpuname != NULL &&
         strcmp(cpuname, BK7258_BT_TEST_REMOTE_NAME) == 0 &&
         strcmp(name, BK7258_BT_TEST_EPT_NAME) == 0;
}

static void bk7258_bt_test_ns_bind(FAR struct rpmsg_device *rdev,
                                   FAR void *priv_, FAR const char *name,
                                   uint32_t dest)
{
  struct bk7258_bt_test_dev_s *priv = priv_;

  priv->ept.priv = priv;
  priv->connection_error = rpmsg_create_ept(
    &priv->ept, rdev, name, RPMSG_ADDR_ANY, dest,
    bk7258_bt_test_ept_cb, NULL);
  if (priv->connection_error >= 0)
    {
      __atomic_store_n(&priv->endpoint_created, true, __ATOMIC_RELEASE);
    }
}
#endif

static void bk7258_bt_test_device_destroy(FAR struct rpmsg_device *rdev,
                                           FAR void *priv_)
{
  struct bk7258_bt_test_dev_s *priv = priv_;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  if (cpuname == NULL || strcmp(cpuname, BK7258_BT_TEST_REMOTE_NAME) != 0)
    {
      return;
    }

  __atomic_store_n(&priv->endpoint_created, false, __ATOMIC_RELEASE);
  priv->connection_error = -ENOTCONN;
#ifdef CONFIG_BK7258_AP_CORE
  __atomic_store_n(&priv->abort, true, __ATOMIC_RELEASE);
  (void)nxsem_post(&priv->request_sem);
#else
  priv->report_valid = false;
  (void)nxsem_post(&priv->report_sem);
#endif

  if (priv->ept.rdev != NULL)
    {
      rpmsg_destroy_ept(&priv->ept);
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_bt_test_initialize(void)
{
  struct bk7258_bt_test_dev_s *priv = &g_bk7258_bt_test;
  int ret;

  if (priv->initialized)
    {
      return OK;
    }

  memset(priv, 0, sizeof(*priv));
  priv->connection_error = -ENOTCONN;
#ifdef CONFIG_BK7258_AP_CORE
  ret = bk7258_bt_test_sem_init(&priv->request_sem);
#else
  ret = bk7258_bt_test_sem_init(&priv->report_sem);
#endif
  if (ret < 0)
    {
      return ret;
    }

#ifdef CONFIG_BK7258_AP_CORE
  ret = rpmsg_register_callback(
    priv, bk7258_bt_test_device_created, bk7258_bt_test_device_destroy,
    NULL, NULL);
#else
  ret = rpmsg_register_callback(
    priv, bk7258_bt_test_device_created, bk7258_bt_test_device_destroy,
    bk7258_bt_test_ns_match, bk7258_bt_test_ns_bind);
#endif
  if (ret < 0)
    {
#ifdef CONFIG_BK7258_AP_CORE
      nxsem_destroy(&priv->request_sem);
#else
      nxsem_destroy(&priv->report_sem);
#endif
      return ret;
    }

#ifdef CONFIG_BK7258_AP_CORE
  ret = bk7258_bt_test_spawn_worker();
  if (ret < 0)
    {
      rpmsg_unregister_callback(
        priv, bk7258_bt_test_device_created,
        bk7258_bt_test_device_destroy, NULL, NULL);
      nxsem_destroy(&priv->request_sem);
      return ret;
    }
#endif

  priv->initialized = true;
  return OK;
}

#ifndef CONFIG_BK7258_AP_CORE
int bk7258_bt_test_run(enum bk7258_bt_test_operation_e operation,
                       uint32_t scan_duration_ms, uint32_t timeout_ms,
                       struct bk7258_bt_test_result_s *result)
{
  struct bk7258_bt_test_dev_s *priv = &g_bk7258_bt_test;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  struct bk7258_bt_test_wire_s request;
  clock_t connect_started;
  uint32_t waited = 0;
  uint32_t slice;
  int ret;

  if (result == NULL ||
      (operation != BK7258_BT_TEST_OPERATION_INFO &&
       operation != BK7258_BT_TEST_OPERATION_SCAN &&
       operation != BK7258_BT_TEST_OPERATION_STATS) ||
      timeout_ms < BK7258_BT_TEST_TIMEOUT_MIN_MS ||
      timeout_ms > BK7258_BT_TEST_TIMEOUT_MAX_MS ||
      ((operation == BK7258_BT_TEST_OPERATION_INFO ||
        operation == BK7258_BT_TEST_OPERATION_STATS) &&
       scan_duration_ms != 0) ||
      (operation == BK7258_BT_TEST_OPERATION_SCAN &&
       (scan_duration_ms < BK7258_BT_TEST_SCAN_MIN_MS ||
        scan_duration_ms > BK7258_BT_TEST_SCAN_MAX_MS)))
    {
      return -EINVAL;
    }

  memset(result, 0, sizeof(*result));
  ret = nxmutex_lock(&g_bk7258_bt_test_lock);
  if (ret < 0)
    {
      return ret;
    }

  connect_started = clock_systime_ticks();
  while (!bk7258_bt_test_endpoint_ready() &&
         !bk7258_bt_test_deadline_expired(connect_started,
                                           BK7258_BT_TEST_CONNECT_MS))
    {
      nxsig_usleep(1000);
    }

  if (!bk7258_bt_test_endpoint_ready())
    {
      ret = priv->connection_error < 0 ?
            priv->connection_error : -ENOTCONN;
      goto out;
    }

  bk7258_bt_test_flush_sem(&priv->report_sem);
  if (++g_bk7258_bt_test_next_sequence == 0)
    {
      g_bk7258_bt_test_next_sequence++;
    }

  priv->waiting_generation = control->generation;
  priv->waiting_sequence = g_bk7258_bt_test_next_sequence;
  priv->report_valid = false;
  priv->connection_error = OK;
  memset(&priv->report, 0, sizeof(priv->report));
  memset(&request, 0, offsetof(struct bk7258_bt_test_wire_s, result));
  request.magic = BK7258_BT_TEST_WIRE_MAGIC;
  request.version = BK7258_BT_TEST_WIRE_VERSION;
  request.command = BK7258_BT_TEST_COMMAND_START;
  request.generation = priv->waiting_generation;
  request.sequence = priv->waiting_sequence;
  request.operation = operation;
  request.scan_duration_ms = scan_duration_ms;
  request.timeout_ms = timeout_ms;

  ret = bk7258_bt_test_send_bounded(
    &request, offsetof(struct bk7258_bt_test_wire_s, result),
    priv->waiting_generation, BK7258_BT_TEST_SEND_TIMEOUT_MS);
  if (ret < 0)
    {
      goto out;
    }

  ret = -ETIMEDOUT;
  while (waited < timeout_ms)
    {
      slice = timeout_ms - waited;
      if (slice > 50u)
        {
          slice = 50u;
        }

      ret = nxsem_tickwait_uninterruptible(&priv->report_sem,
                                            MSEC2TICK(slice));
      if (ret >= 0)
        {
          break;
        }

      if (ret != -ETIMEDOUT)
        {
          goto out;
        }

      if (!bk7258_bt_test_endpoint_ready() ||
          !bk7258_bt_test_generation_ready(priv->waiting_generation))
        {
          ret = priv->connection_error < 0 ?
                priv->connection_error : -ENOTCONN;
          goto out;
        }

      waited += slice;
    }

  if (ret < 0)
    {
      goto out;
    }

  __asm volatile ("dmb sy" ::: "memory");
  if (!priv->report_valid)
    {
      ret = priv->connection_error < 0 ?
            priv->connection_error : -EPROTO;
      goto out;
    }

  memcpy(result, &priv->report, sizeof(*result));
  if (result->magic != BK7258_BT_TEST_RESULT_MAGIC ||
      result->version != BK7258_BT_TEST_RESULT_VERSION ||
      result->size != sizeof(*result) ||
      result->generation != priv->waiting_generation ||
      result->sequence != priv->waiting_sequence ||
      result->operation != (uint32_t)operation)
    {
      ret = -EPROTO;
      goto out;
    }

  ret = result->status;

out:
  nxmutex_unlock(&g_bk7258_bt_test_lock);
  return ret;
}
#endif

#endif /* CONFIG_BK7258_BT_IPC_TEST */
